OdDAI.SelectType.selections
\details
Retreives a set of selectable types.
\returns Returns a set of selectable types.

OdDAI.SelectType.type
\details
Retreives a type code of select type.
\returns Returns a smart pointer to type code of select type.

OdDAI.SelectType.#ctor(OdSharedPtr&lt;OdTypeCode&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,std.set&lt;OdDAI.NamedType!System.Runtime.CompilerServices.IsConst**,std.less&lt;OdDAI.NamedType!System.Runtime.CompilerServices.IsConst**&gt;,std.allocator&lt;OdDAI.NamedType!System.Runtime.CompilerServices.IsConst**&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Creates a new select type object with specified parameters.
\param typeCode   [in] A smart pointer to a type code of select type.
\param selections [in] A set of selectable types.

OdDAI.SelectType.#ctor
\details
Creates a new select type object with default parameters.

OdDAI.SelectType
\details
A class that implements the storing of select types.